_Rarzrabotki/Rarus/USO2/Reports/СМ_СправкаОСтоимостиВыполненныхРаботИЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СМ_СправкаОСтоимостиВыполненныхРаботИЗатрат</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/СМ_СправкаОСтоимостиВыполненныхРаботИЗатрат/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Использовать",Истина);
	МассивЛимЗатрат = ЛимитированныеЗатраты.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("ЛимитированнаяЗатрата");
	
	СписокЛимЗатратНДС = Новый СписокЗначений();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Использовать",Истина);
	ПараметрыОтбора.Вставить("НДС",Истина);
	СписокЛимЗатратНДС.ЗагрузитьЗначения(ЛимитированныеЗатраты.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("ЛимитированнаяЗатрата"));
	СписокЛимЗатратНДС.Добавить(ЛимЗатратаНДС);
	
	Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПолучитьЗаполненныйОтчет(Период,Результат, Смета, СписокЛимЗатратНДС, МассивЛимЗатрат);
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ГлобальнаяСтрокаДереваСмет = Неопределено И Не ГлобальнаяСтрокаДереваСмет.ПометкаУдаления Тогда
		Смета = ГлобальнаяСтрокаДереваСмет.Ссылка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЛимЗатратаНДС) Тогда
		ЗаполнитьЛимЗатратуНДСНаСервере();
	КонецЕсли;
	
	Если ЛимитированныеЗатраты.Количество()=0 Тогда
		ОбновитьТаблицуЛимЗатрат();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛимЗатратуНДСНаСервере()
	
	ЛимЗатратаНДС = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоРеквизиту("Идентификатор","ЛЗ64");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЛимЗатрат()
	
	Если Не ЗначениеЗаполнено(Смета) Тогда
		ЛимитированныеЗатраты.Очистить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата,
		               |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.НомерПоПорядку КАК ЛимитированнаяЗатратаНомерПоПорядку
		               |ИЗ
		               |	Документ.СМ_АктВыполненныхРабот.ЛимитированныеЗатраты КАК СМ_АктВыполненныхРаботЛимитированныеЗатраты
		               |ГДЕ
		               |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ЛокальнаяСмета = &Смета
		               |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛимитированнаяЗатратаНомерПоПорядку";
	ИначеЕсли ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата,
		               |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.НомерПоПорядку КАК ЛимитированнаяЗатратаНомерПоПорядку
		               |ИЗ
		               |	Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.ЛимитированныеЗатраты КАК СМ_АктВыполненныхРаботЛимитированныеЗатраты
		               |		ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ЛокальнаяСмета
		               |ГДЕ
		               |	СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
		               |	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка = &Смета
		               |	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
		               |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛимитированнаяЗатратаНомерПоПорядку";
	ИначеЕсли ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата,
		                |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.НомерПоПорядку КАК ЛимитированнаяЗатратаНомерПоПорядку
		                |ИЗ
		                |	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		                |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.ЛимитированныеЗатраты КАК СМ_АктВыполненныхРаботЛимитированныеЗатраты
		                |			ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ЛокальнаяСмета
		                |		ПО СМ_СводнаяСметаСметы.Смета = СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка
		                |ГДЕ
		                |	СМ_СводнаяСметаСметы.Ссылка = &Смета
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления = ЛОЖЬ
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата,
		                |	СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.НомерПоПорядку
		                |ИЗ
		                |	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.ЛимитированныеЗатраты КАК СМ_АктВыполненныхРаботЛимитированныеЗатраты
		                |		ПО СМ_СводнаяСметаСметы.Смета = СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ЛокальнаяСмета
		                |ГДЕ
		                |	СМ_СводнаяСметаСметы.Ссылка = &Смета
		                |	И СМ_СводнаяСметаСметы.Смета.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.Ссылка.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_АктВыполненныхРаботЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления = ЛОЖЬ
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	ЛимитированнаяЗатратаНомерПоПорядку";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Смета",Смета);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ЛимитированныеЗатраты.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛимЗатратуНДС()
	
	ЭтаФорма.ЛимзатратаНДС = Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка();	
	Для Каждого ТекСтрока Из ЭтаФорма.Смета.ЛимитированныеЗатраты Цикл
		ТекНаименование = НРЕГ(ТекСтрока.ЛимитированнаяЗатрата.Наименование);
		Позиция1 = СтрНайти(ТекНаименование,"налог на добавленную стоимость");
		Позиция2 = СтрНайти(ТекНаименование,"ндс");
		Если Позиция1 > 0 ИЛИ Позиция2 > 0 Тогда
			ЭтаФорма.ЛимзатратаНДС = ТекСтрока.ЛимитированнаяЗатрата;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ЛимЗатратаНДС) Тогда
		ЭтаФорма.ЛимЗатратаНДС = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоРеквизиту("Идентификатор","ЛЗ64");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СметаПриИзменении(Элемент)
	
	ОбновитьТаблицуЛимЗатрат();
	ЗаполнитьЛимЗатратуНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	ПеременнаяТипаСтандартныйПериод = Новый СтандартныйПериод();
	Диалог.Период = ПеременнаяТипаСтандартныйПериод;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеПоказа", ЭтотОбъект, Новый Структура("ПеременнаяТипаСтандартныйПериод",ПеременнаяТипаСтандартныйПериод));
	Диалог.Показать(Оповещение);
	// Если Диалог.Показать(Оповещение) Тогда
	//	ПеременнаяТипаСтандартныйПериод = Диалог.Период;
	//	Период = ПеременнаяТипаСтандартныйПериод;
	// КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПоказа(ТекПериод,ТекПараметр) Экспорт
	Если ТекПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекПараметр.ПеременнаяТипаСтандартныйПериод = ТекПериод;
	Период = ТекПараметр.ПеременнаяТипаСтандартныйПериод;
КонецПроцедуры

&НаКлиенте
Процедура СметаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС 	= Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	СтруктураПараметров 			= Новый Структура;
	СтруктураПараметров.Вставить("ВключатьОС",Истина);
	СтруктураПараметров.Вставить("ВключатьСС",Истина);
	СтруктураПараметров.Вставить("БезПомеченных",Истина);
	СтруктураПараметров.Вставить("ОтборСтройка",Истина);
	
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Смета = ТекЛС;
	ОбновитьТаблицуЛимЗатрат();
	ЗаполнитьЛимЗатратуНДС();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) ИЛИ 
  		 РольДоступна(Метаданные.Роли.СМ_АдминистраторСмета) ИЛИ
		 РольДоступна(Метаданные.Роли.СМ_РедактированиеНСИ) Тогда
		Элементы.ЛимзатратаНДС.Доступность 		= Истина;
		Элементы.ЛимзатратаНДС.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.ЛимзатратаНДС.Доступность 		= Ложь;
		Элементы.ЛимзатратаНДС.ТолькоПросмотр 	= Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
